export declare function randInt(min: number, max: number): number;
/**
 * 根据概率随机选中一个
 *
 * distribution 格式:
 *        [[概率, 值], [概率, 值], [概率, 值], [概率, 值]]
 *       | [概率, 值], [概率, 值], [概率, 值], [概率, 值]
 *       | { 概率: 值, 概率: 值, 概率: 值 }
 *
 * 概率之和应为100
 *
 * Examples:
 *
 * _.roll([[10, 'A'], [10, 'B'], [20, 'C']]) // 10/40: A, 10/40: B, 20/40: C
 * _.roll([[0.1, 'A'], [0.2, 'B'], ['...', 'C']]) // 0.1: A, 0.2: B, others(0.7): C
 * _.roll([10, 'A'], [10, 'B'], [20, 'C']) // 10/40: A, 10/40: B, 20/40: C
 * _.roll({50: 'A', 24: 'B', 26: 'C'})   // 50% A, 24% B, 26% C
 *
 * [[0.7,2],[0.20434,3],[0.06,5],[0.03,10],[0.005,20],[0.0005,50],[0.0001,100],[0.00005,1000],[0.00001,5000]]
 */
export declare function roll(...distribution: any): any;
